public class EpamBasicsBranches3 {
    public static void main(String[] args) {
        int x1 = 10;
        int x2 = 21;
        int x3 = 10;

        int y1 = 1;
        int y2 = 2;
        int y3 = 10;

        if((x3 - x1) / (x2 - x1) == (y3 - y1) / (y2 - y1)){
            System.out.println("Прямые лежат на одной плоскости");
        }
    }
}
/*Basics of software code development, Ветвления задача 3
Даны три точки: А(x1, y1), B(x2, y2) C(x3, y3). Нужно определить, находятся ли точки на одной плоскости. */
