public class EpamBasics4 {
    public static void main(String[] args) {
        double numb = 333.222;
        double resuls = (numb * 1000) % 1000 + (int) numb / 1000.0;
        System.out.println(resuls);
    }
}

/*Basics of software code development, Линейные программы задача 4
Дано число вида nnn.ddd. Нужно поменять целую и дробную части местами*/
