public class EpamBasics6 {
    public static void main(String[] args) {
        int x = 2;
        int y = 3;
        if(((x <= 2 & x >= -2) & (y <= 5 & y >= -2)) ||((y >= -2 ) & (x <= 4 & x >= -4))){
            System.out.println("true");
        }else{
            System.out.println("false");
        }
    }
}
/*Basics of software code development, Линейные программы задача 6

Составить программу, которая печатает true, если точка с координатами x y находится в определенной области*/
